import { handlingUnathorizedError } from './token.js'
import { header } from './templates.js'

const headerLink = document.querySelector('.header').innerHTML = header
const formChat = document.querySelector('.form__chat')
const formChatFile = document.querySelector('.form__chat-file')
const formChatStatus = document.querySelector('.form__chat-status')
const formChatBtn = document.querySelector('.form__chat-btn')
const formChatBtnSvg = document.querySelector('.form__chat-btn-svg')
const loader = document.querySelector('.loader')
const out = document.querySelector('.out')

formChat.addEventListener('submit', preventHandlingFormFile)
formChatFile.addEventListener('change', addFilename)




function serializeForm(formLogin) {
    return new FormData(formLogin)
}


async function uploadFile(body, token) {
    try {
        const response = await fetch('http://127.0.0.1:8002/api/v1/messages/uploadfile', {
        method: 'POST',
        body: body,
        headers: 
        {   
            'Accept': 'application/json',
            'Authorization': `Bearer ${token}`
        },
        })
        
        const data = await response.json()

        if (!response.ok){
            const error = new Error(`${response.status} ${data.detail}`)
            error.status = response.status
            throw error
        }

        return data

    } catch (exception) {
        throw exception
    }
}

async function processingFile(body, token) {
    try {
        const response = await fetch('http://127.0.0.1:8002/api/v1/messages/processingfile', {
        method: 'POST',
        body: JSON.stringify(body),
        headers: 
        {   
            'Accept': 'application/json',
            'Content-Type': 'application/json',
            'Authorization': `Bearer ${token}`,
        },
        })
        
        const data = await response.json()

        if (!response.ok){
            const error = new Error(`${response.status} ${data.detail}`)
            error.status = response.status
            throw error
        }

        return data

    } catch (exception) {
        throw exception
    }
}

function printingText(text, position) {
    if (position === text.length) return
    out.textContent += text[position]
    // out.scrollIntoView(
    //     false
    //     // {behavior: "smooth", block: "end", inline: "end"}
    // )
    setTimeout(() => printingText(text, position+1), 0)
}

async function preventHandlingFormFile(event) {
    event.preventDefault()
    if (!formChatFile.files.length){
        formChatStatus.textContent = "Файл не загружен!!!!"

    }
    return await handlingFormFile()
}

async function handlingFormFile(){
    let responseUpload
    let message
    const accessToken = localStorage.getItem('access_token')
    const validatedForm = serializeForm(formChat)
    console.log(Array.from(validatedForm.entries()))
    try{
        responseUpload = await uploadFile(validatedForm, accessToken) 
    } catch (exception) {
        switch (exception.status){
            case 401: {
                await handlingUnathorizedError()
                responseUpload = await handlingFormFile()
                break
            }
            case 400:
                message = 'Некорректное расширение файла!'
                break
            case 413:
                message = 'Недопустимый размер файла!'
                break          
            case 415:
                message = 'Некорректное содержимое файла!'    
                break
            default:
                message = 'Попробуй еще раз!'
        }
        if (exception.status != 401){
            formChatStatus.textContent = message 
            console.log(exception.message)
        }
        return
    }

    formChatBtn.disabled = true
    formChatFile.disabled = true
    formChatStatus.textContent = ''
    loader.classList.remove('hidden')
    formChatBtnSvg.classList.remove('form__chat-btn-svg--active')

    const { chatId, filename } = responseUpload
    const bodyProcessing = {
        'chatId': chatId,
        'filename': filename
    }

    let responseProcessing
    try {
        responseProcessing = await processingFile(bodyProcessing, accessToken)
    } 
    catch (exception) {
        switch (exception.status) {
            case 401: {
                await handlingUnathorizedError()
                responseProcessing = await processingFile()
                break
            }
            default:
                message = 'Попробуй еще раз!'
        }
        if (message.status != 401) {
            console.log(exception.message)
        }
        return
    }

    loader.classList.add('hidden')
    out.classList.remove('hidden')
    // const startPosition = 0
    // printingText(`
    //     Переписка между участниками Никитой Калымдосом и Владимиром представляет собой живое общение с элементами юмора, эмоциональности и дружеской поддержки. Анализируя содержание сообщений, можно выделить несколько ключевых моментов:\n\n### Основные темы обсуждения\n\n1. **Социальная активность и общение**\n   - Участники часто обсуждают планы на выходные, поездки, встречи друзей и семейные события.\n   - Упоминаются совместные мероприятия, такие как походы на природу, отдых с друзьями и участие в спортивных мероприятиях.\n\n2. **Работа и проекты**\n   - Обсуждаются рабочие проекты, включая разработку приложений, использование инструментов типа Obsidian и Excalidraw, а также возможные партнерства и специалистов для реализации проектов.\n   - Владимир делится техническими проблемами, связанными с установкой драйверов и работой оборудования, а Никита предлагает решения.\n\n3. **Коммуникация и поддержка друг друга**\n   - Переписка наполнена поддержкой и взаимопониманием. Участники делятся своими переживаниями, успехами и неудачами, поддерживая друг друга морально.\n   - Часто используются эмодзи и мемы для выражения эмоций и создания легкой атмосферы общения.\n\n4. **Юмор и юмористические элементы общения**\n   - Многочисленные шутки, каламбуры и забавные фразы делают переписку живой и непринужденной.\n   - Использование мемов, видео-сообщений и картинок добавляет визуальный элемент и усиливает эмоциональность общения.\n\n### Стилистические особенности\n\n- **Эмоциональность**: Переписка насыщена эмоциями, выраженными словами и эмодзи, такими как 🤗, 😂, 🐳, 🔥, 🌟 и другими.\n- **Использование жаргона и сокращений**: Активное использование сокращений (\"ВП\", \"Вов\", \"Чё там\") и специфического языка молодежной культуры делает переписку характерной для молодых людей.\n- **Частота сообщений**: Высокая частота обмена сообщениями отражает близость участников и открытость их отношений.\n\n### Заключение\n\nОбщение между участниками демонстрирует дружбу, доверие и взаимную поддержку. Они открыто делят свои мысли, планы и переживания, создавая теплую атмосферу общения. Эта переписка является примером того, как современные средства коммуникации позволяют людям поддерживать тесный контакт и делиться важными моментами своей жизни`,
    //      startPosition)
    // `
    //     Сааааамыыый ллууууучшииий дееень заааахоооодииил вчееееера-а-а-а-а!!!Сааааамыыый ллууууучшииий дееень заааахоооодииил вчееееера-а-а-а-а!!!Сааааамыыый ллууууучшииий дееень заааахоооодииил вчееееера-а-а-а-а!!!Сааааамыыый ллууууучшииий дееень заааахоооодииил вчееееера-а-а-а-а!!!Сааааамыыый ллууууучшииий дееень заааахоооодииил вчееееера-а-а-а-а!!!Сааааамыыый ллууууучшииий дееень заааахоооодииил вчееееера-а-а-а-а!!!Сааааамыыый ллууууучшииий дееень заааахоооодииил вчееееера-а-а-а-а!!!Сааааамыыый ллууууучшииий дееень заааахоооодииил вчееееера-а-а-а-а!!!Сааааамыыый ллууууучшииий дееень заааахоооодииил вчееееера-а-а-а-а!!!Сааааамыыый ллууууучшииий дееень заааахоооодииил вчееееера-а-а-а-а!!!Сааааамыыый ллууууучшииий дееень заааахоооодииил вчееееера-а-а-а-а!!!Сааааамыыый ллууууучшииий дееень заааахоооодииил вчееееера-а-а-а-а!!!
    //     Сааааамыыый ллууууучшииий дееень заааахоооодииил вчееееера-а-а-а-а!!!Сааааамыыый ллууууучшииий дееень заааахоооодииил вчееееера-а-а-а-а!!!Сааааамыыый ллууууучшииий дееень заааахоооодииил вчееееера-а-а-а-а!!!Сааааамыыый ллууууучшииий дееень заааахоооодииил вчееееера-а-а-а-а!!!Сааааамыыый ллууууучшииий дееень заааахоооодииил вчееееера-а-а-а-а!!!Сааааамыыый ллууууучшииий дееень заааахоооодииил вчееееера-а-а-а-а!!!Сааааамыыый ллууууучшииий дееень заааахоооодииил вчееееера-а-а-а-а!!!Сааааамыыый ллууууучшииий дееень заааахоооодииил вчееееера-а-а-а-а!!!Сааааамыыый ллууууучшииий дееень заааахоооодииил вчееееера-а-а-а-а!!!Сааааамыыый ллууууучшииий дееень заааахоооодииил вчееееера-а-а-а-а!!!Сааааамыыый ллууууучшииий дееень заааахоооодииил вчееееера-а-а-а-а!!!Сааааамыыый ллууууучшииий дееень заааахоооодииил вчееееера-а-а-а-а!!!
    //     Сааааамыыый ллууууучшииий дееень заааахоооодииил вчееееера-а-а-а-а!!!Сааааамыыый ллууууучшииий дееень заааахоооодииил вчееееера-а-а-а-а!!!Сааааамыыый ллууууучшииий дееень заааахоооодииил вчееееера-а-а-а-а!!!Сааааамыыый ллууууучшииий дееень заааахоооодииил вчееееера-а-а-а-а!!!Сааааамыыый ллууууучшииий дееень заааахоооодииил вчееееера-а-а-а-а!!!Сааааамыыый ллууууучшииий дееень заааахоооодииил вчееееера-а-а-а-а!!!Сааааамыыый ллууууучшииий дееень заааахоооодииил вчееееера-а-а-а-а!!!Сааааамыыый ллууууучшииий дееень заааахоооодииил вчееееера-а-а-а-а!!!Сааааамыыый ллууууучшииий дееень заааахоооодииил вчееееера-а-а-а-а!!!Сааааамыыый ллууууучшииий дееень заааахоооодииил вчееееера-а-а-а-а!!!Сааааамыыый ллууууучшииий дееень заааахоооодииил вчееееера-а-а-а-а!!!Сааааамыыый ллууууучшииий дееень заааахоооодииил вчееееера-а-а-а-а!!!
    //     Сааааамыыый ллууууучшииий дееень заааахоооодииил вчееееера-а-а-а-а!!!Сааааамыыый ллууууучшииий дееень заааахоооодииил вчееееера-а-а-а-а!!!Сааааамыыый ллууууучшииий дееень заааахоооодииил вчееееера-а-а-а-а!!!Сааааамыыый ллууууучшииий дееень заааахоооодииил вчееееера-а-а-а-а!!!Сааааамыыый ллууууучшииий дееень заааахоооодииил вчееееера-а-а-а-а!!!Сааааамыыый ллууууучшииий дееень заааахоооодииил вчееееера-а-а-а-а!!!Сааааамыыый ллууууучшииий дееень заааахоооодииил вчееееера-а-а-а-а!!!Сааааамыыый ллууууучшииий дееень заааахоооодииил вчееееера-а-а-а-а!!!Сааааамыыый ллууууучшииий дееень заааахоооодииил вчееееера-а-а-а-а!!!Сааааамыыый ллууууучшииий дееень заааахоооодииил вчееееера-а-а-а-а!!!Сааааамыыый ллууууучшииий дееень заааахоооодииил вчееееера-а-а-а-а!!!Сааааамыыый ллууууучшииий дееень заааахоооодииил вчееееера-а-а-а-а!!!
    //     Сааааамыыый ллууууучшииий дееень заааахоооодииил вчееееера-а-а-а-а!!!Сааааамыыый ллууууучшииий дееень заааахоооодииил вчееееера-а-а-а-а!!!Сааааамыыый ллууууучшииий дееень заааахоооодииил вчееееера-а-а-а-а!!!Сааааамыыый ллууууучшииий дееень заааахоооодииил вчееееера-а-а-а-а!!!Сааааамыыый ллууууучшииий дееень заааахоооодииил вчееееера-а-а-а-а!!!Сааааамыыый ллууууучшииий дееень заааахоооодииил вчееееера-а-а-а-а!!!Сааааамыыый ллууууучшииий дееень заааахоооодииил вчееееера-а-а-а-а!!!Сааааамыыый ллууууучшииий дееень заааахоооодииил вчееееера-а-а-а-а!!!Сааааамыыый ллууууучшииий дееень заааахоооодииил вчееееера-а-а-а-а!!!Сааааамыыый ллууууучшииий дееень заааахоооодииил вчееееера-а-а-а-а!!!Сааааамыыый ллууууучшииий дееень заааахоооодииил вчееееера-а-а-а-а!!!Сааааамыыый ллууууучшииий дееень заааахоооодииил вчееееера-а-а-а-а!!!
    //     Сааааамыыый ллууууучшииий дееень заааахоооодииил вчееееера-а-а-а-а!!!Сааааамыыый ллууууучшииий дееень заааахоооодииил вчееееера-а-а-а-а!!!Сааааамыыый ллууууучшииий дееень заааахоооодииил вчееееера-а-а-а-а!!!Сааааамыыый ллууууучшииий дееень заааахоооодииил вчееееера-а-а-а-а!!!Сааааамыыый ллууууучшииий дееень заааахоооодииил вчееееера-а-а-а-а!!!Сааааамыыый ллууууучшииий дееень заааахоооодииил вчееееера-а-а-а-а!!!Сааааамыыый ллууууучшииий дееень заааахоооодииил вчееееера-а-а-а-а!!!Сааааамыыый ллууууучшииий дееень заааахоооодииил вчееееера-а-а-а-а!!!Сааааамыыый ллууууучшииий дееень заааахоооодииил вчееееера-а-а-а-а!!!Сааааамыыый ллууууучшииий дееень заааахоооодииил вчееееера-а-а-а-а!!!Сааааамыыый ллууууучшииий дееень заааахоооодииил вчееееера-а-а-а-а!!!Сааааамыыый ллууууучшииий дееень заааахоооодииил вчееееера-а-а-а-а!!!
    //     Сааааамыыый ллууууучшииий дееень заааахоооодииил вчееееера-а-а-а-а!!!Сааааамыыый ллууууучшииий дееень заааахоооодииил вчееееера-а-а-а-а!!!Сааааамыыый ллууууучшииий дееень заааахоооодииил вчееееера-а-а-а-а!!!Сааааамыыый ллууууучшииий дееень заааахоооодииил вчееееера-а-а-а-а!!!Сааааамыыый ллууууучшииий дееень заааахоооодииил вчееееера-а-а-а-а!!!Сааааамыыый ллууууучшииий дееень заааахоооодииил вчееееера-а-а-а-а!!!Сааааамыыый ллууууучшииий дееень заааахоооодииил вчееееера-а-а-а-а!!!Сааааамыыый ллууууучшииий дееень заааахоооодииил вчееееера-а-а-а-а!!!Сааааамыыый ллууууучшииий дееень заааахоооодииил вчееееера-а-а-а-а!!!Сааааамыыый ллууууучшииий дееень заааахоооодииил вчееееера-а-а-а-а!!!Сааааамыыый ллууууучшииий дееень заааахоооодииил вчееееера-а-а-а-а!!!Сааааамыыый ллууууучшииий дееень заааахоооодииил вчееееера-а-а-а-а!!!
    // `

    const startPosition = 0
    printingText(responseProcessing.text, startPosition)
}

function addFilename(){
    // console.log(fileInput)
    if (formChatFile.files.length > 0){
        formChatStatus.textContent = formChatFile.files[0].name
        formChatBtnSvg.classList.add('form__chat-btn-svg--active')
    }x
}



// const str = 'Сааааамыыый ллууууучшииий дееень заааахоооодииил вчееееера-а-а-а-а!!!'

// let position = 0

// const typeText = () => {
//     if (position === str.length) return
//     out.textContent += str[position]
//     position++
//     setTimeout(typeText, 50)
// }


// function getRandomInt(min = 50, max = 750){
//     return Math.floor(min + Math.random() * (max + 1 - min))
// }

// typeText()
